{
    "accept":{"description":"Specifies the types of files that the server accepts (only for type=\"file\")"},
    "accept-charset":{"description":"Specifies the character encodings that are to be used for the form submission"},
    "accesskey":{"description":"Global Attributes Specifies a shortcut key to activate/focus an element"},
    "action":{"description":"Specifies where to send the form-data when a form is submitted"},
    "align":{"description":"Not supported in HTML 5. Specifies the alignment according to surrounding elements. Use CSS instead"},
    "alt":{"description":"Specifies an alternate text when the original element fails to display"},
    "async":{"description":"Specifies that the script is executed asynchronously (only for external scripts)"},
    "autocomplete":{"description":"Specifies whether the <form> or the <input> element should have autocomplete enabled"},
    "autofocus":{"description":"Specifies that the element should automatically get focus when the page loads"},
    "autoplay":{"description":"Specifies that the audio/video will start playing as soon as it is ready"},
    "behavior":{"description":"Establece cómo se desplazará el texto en la etiqueta marquee. Los valores posibles son scroll, slide, y alternate. Si no hay un valor especificado, el valor por defecto establecido es scroll. Scroll: Hara que lo que este en la marquesina se mueva de derecha a izquierda, de manera ininterrumpida. Slide: Una vez que completa el recorrido de derecha a izquierda(por defecto) se detiene. Alternate: Se movera de una esquina a la otra, dando el efecto de rebote."},
    "bgcolor":{"description":"Not supported in HTML 5. Specifies the background color of an element. Use CSS instead"},
    "border":{"description":"Not supported in HTML 5. Specifies the width of the border of an element. Use CSS instead"},
    "charset":{"description":"Specifies the character encoding"},
    "checked":{"description":"Specifies that an <input> element should be pre-selected when the page loads (for type=\"checkbox\" or type=\"radio\")"},
    "cite":{"description":"Specifies a URL which explains the quote/deleted/inserted text"},
    "class":{"description":"Global Attributes Specifies one or more classnames for an element (refers to a class in a style sheet)"},
    "color":{"description":"Not supported in HTML 5. Specifies the text color of an element. Use CSS instead"},
    "cols":{"description":"Specifies the visible width of a text area"},
    "colspan":{"description":"Specifies the number of columns a table cell should span"},
    "content":{"description":"Gives the value associated with the http-equiv or name attribute"},
    "contenteditable":{"description":"Global Attributes. Specifies whether the content of an element is editable or not"},
    "controls":{"description":"Specifies that audio/video controls should be displayed (such as a play/pause button etc)"},
    "coords":{"description":"Specifies the coordinates of the area"},
    "data":{"description":"Specifies the URL of the resource to be used by the object"},
    "data-*":{"description":"Global Attributes. Used to store custom data private to the page or application"},
    "datetime":{"description":"Specifies the date and time"},
    "default":{"description":"Specifies that the track is to be enabled if the user's preferences do not indicate that another track would be more appropriate"},
    "defer":{"description":"Specifies that the script is executed when the page has finished parsing (only for external scripts)"},
    "dir":{"description":"Global Attributes. Specifies the text direction for the content in an element"},
    "direction":{"description":"Establece la dirección en la que el texto contenido se desplazará. Los valores posibles son left (para moverse hacia la izquierda), right (para moverse a la derecha), up (hacia arriba) y down (hacia abajo). Si no se especifica un valor, por defecto será left."},
    "dirname":{"description":"Specifies that the text direction will be submitted"},
    "disabled":{"description":"Specifies that the specified element/group of elements should be disabled"},
    "download":{"description":"Specifies that the target will be downloaded when a user clicks on the hyperlink"},
    "draggable":{"description":"Global Attributes. Specifies whether an element is draggable or not"},
    "enctype":{"description":"Specifies how the form-data should be encoded when submitting it to the server (only for method=\"post\")"},
    "for":{"description":"Specifies which form element(s) a label/calculation is bound to"},
    "form":{"description":"Specifies the name of the form the element belongs to"},
    "formaction":{"description":"Specifies where to send the form-data when a form is submitted. Only for type=\"submit\""},
    "headers":{"description":"Specifies one or more headers cells a cell is related to"},
    "height":{"description":"Specifies the height of the element"},
    "hidden":{"description":"Global Attributes. Specifies that an element is not yet, or is no longer, relevant"},
    "high":{"description":"Specifies the range that is considered to be a high value"},
    "href":{"description":"Specifies the URL of the page the link goes to"},
    "hreflang":{"description":"Specifies the language of the linked document"},
    "hspace":{"desciption":"Establece el margen horizontal."},
    "http-equiv":{"description":"Provides an HTTP header for the information/value of the content attribute"},
    "id":{"description":"Global Attributes. Specifies a unique id for an element"},
    "ismap":{"description":"Specifies an image as a server-side image map"},
    "kind":{"description":"Specifies the kind of text track"},
    "label":{"description":"Specifies the title of the text track"},
    "lang":{"description":"Global Attributes. Specifies the language of the element's content"},
    "list":{"description":"Refers to a <datalist> element that contains pre-defined options for an <input> element"},
    "loop":{"description":"Specifies that the audio/video will start over again, every time it is finished"},
    "low":{"description":"Specifies the range that is considered to be a low value"},
    "max":{"description":"Specifies the maximum value"},
    "maxlength":{"description":"Specifies the maximum number of characters allowed in an element"},
    "media":{"description":"Specifies what media/device the linked document is optimized for"},
    "method":{"description":"Specifies the HTTP method to use when sending form-data"},
    "min":{"description":"Specifies a minimum value"},
    "multiple":{"description":"Specifies that a user can enter more than one value"},
    "muted":{"description":"Specifies that the audio output of the video should be muted"},
    "name":{"description":"Specifies the name of the element"},
    "novalidate":{"description":"Specifies that the form should not be validated when submitted"},
    "onabort":{"description":"Script to be run on abort"},
    "onafterprint":{"description":"Script to be run after the document is printed"},
    "onbeforeprint":{"description":"Script to be run before the document is printed"},
    "onbeforeunload":{"description":"Script to be run when the document is about to be unloaded"},
    "onblur":{"description":"All visible elements. Script to be run when the element loses focus"},
    "onbounce":{"description":"Este evento se lanza cuando la marquesina llegó al final del desplazamiento. Ésto solo se activa cuando el atributo behavior está establecido en alternate."},
    "oncanplay":{"description":"Script to be run when a file is ready to start playing (when it has buffered enough to begin)"},
    "oncanplaythrough":{"description":"Script to be run when a file can be played all the way to the end without pausing for buffering"},
    "onchange":{"description":"All visible elements. Script to be run when the value of the element is changed"},
    "onclick":{"description":"All visible elements. Script to be run when the element is being clicked"},
    "oncontextmenu":{"description":"All visible elements. Script to be run when a context menu is triggered"},
    "oncopy":{"description":"All visible elements. Script to be run when the content of the element is being copied"},
    "oncuechange":{"description":"Script to be run when the cue changes in a <track> element"},
    "oncut":{"description":"All visible elements. Script to be run when the content of the element is being cut"},
    "ondblclick":{"description":"All visible elements. Script to be run when the element is being double-clicked"},
    "ondrag":{"description":"All visible elements. Script to be run when the element is being dragged"},
    "ondragend":{"description":"All visible elements. Script to be run at the end of a drag operation"},
    "ondragenter":{"description":"All visible elements. Script to be run when an element has been dragged to a valid drop target"},
    "ondragleave":{"description":"All visible elements. Script to be run when an element leaves a valid drop target"},
    "ondragover":{"description":"All visible elements. Script to be run when an element is being dragged over a valid drop target"},
    "ondragstart":{"description":"All visible elements. Script to be run at the start of a drag operation"},
    "ondrop":{"description":"All visible elements. Script to be run when dragged element is being dropped"},
    "ondurationchange":{"description":"Script to be run when the length of the media changes"},
    "onemptied":{"description":"Script to be run when something bad happens and the file is suddenly unavailable (like unexpectedly disconnects)"},
    "onended":{"description":"Script to be run when the media has reach the end (a useful event for messages like \"thanks for listening\")"},
    "onerror":{"description":"Script to be run when an error occurs"},
    "onfinish":{"description":"Este evento se lanza cuando la marquesina repitió el desplazamiento la cantidad de veces establecidas en el atributo loop. El evento se lanza solo si el atributo loop tiene un valor mayor a 0."},
    "onfocus":{"description":"All visible elements. Script to be run when the element gets focus"},
    "onhashchange":{"description":"Script to be run when there has been changes to the anchor part of the a URL"},
    "oninput":{"description":"All visible elements. Script to be run when the element gets user input"},
    "oninvalid":{"description":"All visible elements. Script to be run when the element is invalid"},
    "onkeydown":{"description":"All visible elements. Script to be run when a user is pressing a key"},
    "onkeypress":{"description":"All visible elements. Script to be run when a user presses a key"},
    "onkeyup":{"description":"All visible elements. Script to be run when a user releases a key"},
    "onload":{"description":"Script to be run when the element is finished loading"},
    "onloadeddata":{"description":"Script to be run when media data is loaded"},
    "onloadedmetadata":{"description":"Script to be run when meta data (like dimensions and duration) are loaded"},
    "onloadstart":{"description":"Script to be run just as the file begins to load before anything is actually loaded"},
    "onmousedown":{"description":"All visible elements. Script to be run when a mouse button is pressed down on an element"},
    "onmousemove":{"description":"All visible elements. Script to be run as long as the  mouse pointer is moving over an element"},
    "onmouseout":{"description":"All visible elements. Script to be run when a mouse pointer moves out of an element"},
    "onmouseover":{"description":"All visible elements. Script to be run when a mouse pointer moves over an element"},
    "onmouseup":{"description":"All visible elements. Script to be run when a mouse button is released over an element"},
    "onmousewheel":{"description":"All visible elements. Script to be run when a mouse wheel is being scrolled over an element"},
    "onoffline":{"description":"Script to be run when the browser starts to work offline"},
    "ononline":{"description":"Script to be run when the browser starts to work online"},
    "onpagehide":{"description":"Script to be run when a user navigates away from a page"},
    "onpageshow":{"description":"Script to be run when a user navigates to a page"},
    "onpaste":{"description":"All visible elements. Script to be run when the user pastes some content in an element"},
    "onpause":{"description":"Script to be run when the media is paused either by the user or programmatically"},
    "onplay":{"description":"Script to be run when the media has started playing"},
    "onplaying":{"description":"Script to be run when the media has started playing"},
    "onpopstate":{"description":"Script to be run when the window's history changes."},
    "onprogress":{"description":"Script to be run when the browser is in the process of getting the media data"},
    "onratechange":{"description":"Script to be run each time the playback rate changes (like when a user switches to a slow motion or fast forward mode)."},
    "onreset":{"description":"Script to be run when a reset button in a form is clicked."},
    "onresize":{"description":"Script to be run when the browser window is being resized."},
    "onscroll":{"description":"All visible elements. Script to be run when an element's scrollbar is being scrolled"},
    "onsearch":{"description":"Script to be run when the user writes something in a search field (for <input=\"search\">)"},
    "onseeked":{"description":"Script to be run when the seeking attribute is set to false indicating that seeking has ended"},
    "onseeking":{"description":"Script to be run when the seeking attribute is set to true indicating that seeking is active"},
    "onselect":{"description":"All visible elements. Script to be run when the element gets selected"},
    "onstalled":{"description":"Script to be run when the browser is unable to fetch the media data for whatever reason"},
    "onstart":{"description":"Este evento se lanza cuando la marquesina comienza su desplazamiento."},
    "onstorage":{"description":"Script to be run when a Web Storage area is updated"},
    "onsubmit":{"description":"Script to be run when a form is submitted"},
    "onsuspend":{"description":"Script to be run when fetching the media data is stopped before it is completely loaded for whatever reason"},
    "ontimeupdate":{"description":"Script to be run when the playing position has changed (like when the user fast forwards to a different point in the media)"},
    "ontoggle":{"description":"Script to be run when the user opens or closes the <details> element"},
    "onunload":{"description":"Script to be run when a page has unloaded (or the browser window has been closed)"},
    "onvolumechange":{"description":"Script to be run each time the volume of a video/audio has been changed"},
    "onwaiting":{"description":"Script to be run when the media has paused but is expected to resume (like when the media pauses to buffer more data)"},
    "onwheel":{"description":"All visible elements. Script to be run when the mouse wheel rolls up or down over an element"},
    "open":{"description":"Specifies that the details should be visible (open) to the user"},
    "optimum":{"description":"Specifies what value is the optimal value for the gauge"},
    "pattern":{"description":"Specifies a regular expression that an <input> element's value is checked against"},
    "placeholder":{"description":"Specifies a short hint that describes the expected value of the element"},
    "poster":{"description":"Specifies an image to be shown while the video is downloading, or until the user hits the play button"},
    "preload":{"description":"Specifies if and how the author thinks the audio/video should be loaded when the page loads"},
    "readonly":{"description":"Specifies that the element is read-only"},
    "rel":{"description":"Specifies the relationship between the current document and the linked document"},
    "required":{"description":"Specifies that the element must be filled out before submitting the form"},
    "reversed":{"description":"Specifies that the list order should be descending (9,8,7...)"},
    "rows":{"description":"Specifies the visible number of lines in a text area"},
    "rowspan":{"description":"Specifies the number of rows a table cell should span"},
    "sandbox":{"description":"Enables an extra set of restrictions for the content in an <iframe>"},
    "scrollamount":{"description":"Establece el valor de movimiento para cada intervalo en pixeles. Por defecto su valor es 6."},
    "scrolldelay":{"description":"Establece el intervalo entre cada desplazamiento, en milisegundos. El valor por defecto es 85. Nota: Cualquier valor inferior a 60 será ignorado, (puesto que el valor minimo es 60) y se establecerá 60 en su lugar. Salvo que se especifique truespeed."},
    "scope":{"description":"Specifies whether a header cell is a header for a column, row, or group of columns or rows"},
    "selected":{"description":"Specifies that an option should be pre-selected when the page loads"},
    "shape":{"description":"Specifies the shape of the area"},
    "size":{"description":"Specifies the width, in characters (for <input>) or specifies the number of visible options (for <select>)"},
    "sizes":{"description":"Specifies the size of the linked resource"},
    "slot":{"description":"Specifies the slot in a template"},
    "span":{"description":"Specifies the number of columns to span"},
    "spellcheck":{"description":"Global Attributes. Specifies whether the element is to have its spelling and grammar checked or not"},
    "src":{"description":"Specifies the URL of the media file"},
    "srcdoc":{"description":"Specifies the HTML content of the page to show in the <iframe>"},
    "srclang":{"description":"Specifies the language of the track text data (required if kind=subtitles)"},
    "srcset":{"description":"Specifies the URL of the image to use in different situations"},
    "start":{"description":"Specifies the start value of an ordered list"},
    "step":{"description":"Specifies the legal number intervals for an input field"},
    "style":{"description":"Global Attributes. Specifies an inline CSS style for an element"},
    "tabindex":{"description":"Global Attributes. Specifies the tabbing order of an element"},
    "target":{"description":"Specifies the target for where to open the linked document or where to submit the form"},
    "title":{"description":"Global Attributes. Specifies extra information about an element"},
    "translate":{"description":"Global Attributes. Specifies whether the content of an element should be translated or not"},
    "truespeed":{"description":"Por defecto, si los valores de scrolldelay son inferiores a 60 serán ignorados. Pero si truespeed está presente, esos valores inferiores a 60 serán aceptados."},
    "type":{"description":"Specifies the type of element"},
    "usemap":{"description":"Specifies an image as a client-side image map"},
    "value":{"description":"Specifies the value of the element"},
    "vspace":{"description":"Establece el margen vertical en pixeles o en un valor porcentual."},
    "width":{"description":"Specifies the width of the element"},
    "wrap":{"description":"Specifies how the text in a text area is to be wrapped when submitted in a form"}
}